tap "airplanedev/tap"
tap "asicsdigital/strongdm"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "knative-extensions/kn-plugins"
tap "knative/client"
tap "ngrok/ngrok"
tap "pkgxdev/made"
tap "txn2/tap"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Shell plugin manager
brew "antibody"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Test your configuration files using Open Policy Agent
brew "conftest"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Build automation tool for the container era
brew "earthly"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Command-line option parsing utility
brew "gnu-getopt"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-Line Interface for Hasura GraphQL Engine
brew "hasura-cli"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Postgres C API library
brew "libpq"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Utility for directing compilation
brew "make"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Highly capable, feature-rich programming language
brew "perl"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Non-validating SQL parser
brew "sqlparse"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Unix pager optimized for psql
brew "pspg"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Persistent key-value database, with built-in net interface
brew "redis"
# Safe, concurrent, practical language
brew "rust"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
brew "airplanedev/tap/airplane"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
brew "knative-extensions/kn-plugins/quickstart"
brew "knative/client/kn"
# Run Anything
brew "pkgxdev/made/pkgx"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Development environment
cask "hashicorp-vagrant"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
cask "strongdm"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "arcsine.chronicler"
vscode "blodwynn.featurehighlight"
vscode "bradymholt.pgformatter"
vscode "byi8220.indented-block-highlighting"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "earthly.earthfile-syntax-highlighting"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gurumukhi.selected-lines-count"
vscode "hbenl.vscode-test-explorer"
vscode "ipedrazas.kubernetes-snippets"
vscode "leizongmin.node-module-intellisense"
vscode "massi.javascript-docstrings"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "njpwerner.autodocstring"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "phplasma.csv-to-table"
vscode "pnp.polacode"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "samuelcolvin.jinjahtml"
vscode "shardulm94.trailing-spaces"
vscode "softwaredotcom.swdc-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "tyriar.sort-lines"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "wattenberger.footsteps"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
